TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G5187/driverlib/empty_driverlib_src/ti/driverlib/dl_i2s.h
/*
 * Copyright (c) 2024, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_i2s.h
 *  @brief      Inter-Integrated Circuit Sound (I2S) Driver Library
 *  @defgroup   I2S  Inter-Integrated Circuit Sound (I2S)
 *
 *  @anchor ti_dl_dl_i2s_Overview
 *  # Overview
 *
 *   The I2S Library allows full configuration of the MSPM0 I2S module.
 *   The I2S module provides a standardized serial interface to transfer audio
 *   data between MSP devices and other external devices (such as an audio
 *   amplifier).
 *
 *  <hr>
 ******************************************************************************
 */
/** @addtogroup I2S
 * @{
 */
#ifndef ti_dl_dl_i2s__include
#define ti_dl_dl_i2s__include

#include <stdbool.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>

#ifdef __MSPM0_HAS_I2S__

#ifdef __cplusplus
extern "C" {
#endif

/* clang-format off */

#if (I2S0_SYS_SINGLE_PIN == 0)
/**
 *  @brief Device supports multiple data pins
 */
#define DEVICE_HAS_MULTIPLE_DATA_PIN
#endif

/**
 *  @brief I2S Minimum factor of the division ratio used to generate the
 *  controller clock (MCLK). The minimum is 2, since 0 is evaluated as
 *  1024, which is the maximum factor, and 1 is invalid.
 */
#define DL_I2S_MDIV_MINIMUM                                      ((uint32_t)2U)

/**
 *  @brief I2S Maximum factor of the division ratio used to generate the
 *  controller clock (MCLK). The maximum is 0, which is interpreted as 1024.
 */
#define DL_I2S_MDIV_MAXIMUM                                      ((uint32_t)0U)

/**
 *  @brief I2S Invalid factor of the division ratio used to generate the
 *  controller clock (MCLK). This is 1.
 */
#define DL_I2S_MDIV_INVALID                                      ((uint32_t)1U)

/**
 *  @brief I2S Minimum factor of the division ratio used to generate BCLK. The
 *  minimum is 2, since the 0 is interpreted as 1024, which is the maximum
 *  factor, and 1 is invalid.
 */
#define DL_I2S_BDIV_MINIMUM                                      ((uint32_t)2U)

/**
 *  @brief I2S Maximum factor of the division ratio used to generate BCLK.
 *  The maximum is 0, which is interpreted as 1024.
 */
#define DL_I2S_BDIV_MAXIMUM                                      ((uint32_t)0U)

/**
 *  @brief I2S Invalid factor of the division ratio used to generate BCLK. This
 *  is 1.
 */
#define DL_I2S_BDIV_INVALID                                      ((uint32_t)1U)

/** @addtogroup DL_I2S_INTERRUPT
 *  @{
 */
/*!
 * @brief WCLK Error Interrupt
 */
#define DL_I2S_INTERRUPT_WCLK_ERROR              (I2S_CPU_INT_IMASK_WCLKERR_EN)

/*!
 * @brief RXFIFO Trigger when >= trigger level Interrupt
 */
#define DL_I2S_INTERRUPT_RXFIFO_TRIGGER           (I2S_CPU_INT_IMASK_RXINT_SET)

/*!
 * @brief TXFIFO when <= trigger level Interrupt
 */
#define DL_I2S_INTERRUPT_TXFIFO_TRIGGER           (I2S_CPU_INT_IMASK_TXINT_SET)

/*!
 * @brief DMA Done on RX Event Channel Interrupt
 */
#define DL_I2S_INTERRUPT_DMA_DONE_RX        (I2S_CPU_INT_IMASK_DMA_DONE_RX_SET)

/*!
 * @brief DMA Done on TX Event Channel Interrupt
 */
#define DL_I2S_INTERRUPT_DMA_DONE_TX        (I2S_CPU_INT_IMASK_DMA_DONE_TX_SET)

/*!
 * @brief RXFIFO Overflow Event Interrupt
 */
#define DL_I2S_INTERRUPT_RXFIFO_OVERFLOW     (I2S_CPU_INT_IMASK_RXFIFO_OVF_SET)

/*!
 * @brief TXFIFO Underflow Event Interrupt
 */
#define DL_I2S_INTERRUPT_TXFIFO_UNDERFLOW    (I2S_CPU_INT_IMASK_TXFIFO_UNF_SET)

/** @}*/

/** @addtogroup DL_I2S_DMA_INTERRUPT
 *  @{
 */
/*!
 * @brief Transmit interrupt for DMA trigger
 */
#define DL_I2S_DMA_INTERRUPT_TX_TRIGGER       (I2S_DMA_TRIG_TX_IMASK_TXINT_SET)

/*!
 * @brief Receive interrupt for DMA trigger
 */
#define DL_I2S_DMA_INTERRUPT_RX_TRIGGER       (I2S_DMA_TRIG_RX_IMASK_RXINT_SET)

/** @}*/

/* clang-format on */

/** @enum DL_I2S_WORD_BAUD_CLOCK_SOURCE */
typedef enum {
    /*! No source for audio clocks WCLK and BCLK */
    DL_I2S_WORD_BAUD_CLOCK_SOURCE_NONE = I2S_WCLKSRC_WBCLKSRC_NONE,
    /*! External source for audio clocks WCLK and BCLK from pin */
    DL_I2S_WORD_BAUD_CLOCK_SOURCE_EXTERNAL = I2S_WCLKSRC_WBCLKSRC_EXT,
    /*! Internal source for audio clocks WCLK and BCLK from module PRCM */
    DL_I2S_WORD_BAUD_CLOCK_SOURCE_INTERNAL = I2S_WCLKSRC_WBCLKSRC_INT,
} DL_I2S_WORD_BAUD_CLOCK_SOURCE;

/** @enum DL_I2S_CLOCK_SOURCE */
typedef enum {
    /*! Select SYSOSC as the clock source for I2S */
    DL_I2S_CLOCK_SOURCE_SYSOSC = I2S_CLKCFG_DAICLK_SYSOSC,
    /*! Select HFXT as the clock source for I2S */
    DL_I2S_CLOCK_SOURCE_HFXT = I2S_CLKCFG_DAICLK_HFXT,
    /*! Select PLL as the clock source for I2S */
    DL_I2S_CLOCK_SOURCE_PLL = I2S_CLKCFG_DAICLK_PLL,
} DL_I2S_CLOCK_SOURCE;

/** @enum DL_I2S_WCLK_INVERSION */
typedef enum {
    /*! WCLK is not inverted */
    DL_I2S_WCLK_INVERSION_DISABLED = I2S_WCLKSRC_WCLKINV_NOT_INVERTED,
    /*! WCLK is inverted */
    DL_I2S_WCLK_INVERSION_ENABLED = I2S_WCLKSRC_WCLKINV_INVERTED,
} DL_I2S_WCLK_INVERSION;

/** @enum DL_I2S_PHASE */
typedef enum {
    /*! I2S Single-Phase (DSP format) */
    DL_I2S_PHASE_SINGLE = I2S_FMTCFG_DUALPHASE_SINGLEPHASE,
    /*! I2S Dual-Phase (I2S, LJF and RJF) */
    DL_I2S_PHASE_DUAL = I2S_FMTCFG_DUALPHASE_DUALPHASE,
} DL_I2S_PHASE;

/** @enum DL_I2S_SAMPLE_EDGE */
typedef enum {
    /*! Data sampled on negative edge, clocked out on positive edge */
    DL_I2S_SAMPLE_EDGE_NEG = I2S_FMTCFG_SMPLEDGE_NEGEDGE,
    /*! Data sampled on positive edge, clocked out on negative edge */
    DL_I2S_SAMPLE_EDGE_POS = I2S_FMTCFG_SMPLEDGE_POSEDGE,
} DL_I2S_SAMPLE_EDGE;

/** @enum DL_I2S_MEMORY_LENGTH */
typedef enum {
    /*! 16-bit memory access per sample */
    DL_I2S_MEMORY_LENGTH_16_BIT = I2S_FMTCFG_MEMLEN32_16BIT,
    /*! 32-bit memory access per sample */
    DL_I2S_MEMORY_LENGTH_32_BIT = I2S_FMTCFG_MEMLEN32_32BIT,
} DL_I2S_MEMORY_LENGTH;

/** @enum DL_I2S_DATA_DELAY */
typedef enum {
    /*! Zero BCLK period delay between WCLK edge and MSB of first word */
    DL_I2S_DATA_DELAY_ZERO = I2S_FMTCFG_DATADLY_ZERO,
    /*! One BCLK period delay between WCLK edge and MSB of first word */
    DL_I2S_DATA_DELAY_ONE = I2S_FMTCFG_DATADLY_ONE,
    /*! Two BCLK periods delay between WCLK edge and MSB of first word */
    DL_I2S_DATA_DELAY_TWO = I2S_FMTCFG_DATADLY_TWO,
    /*! Max BCLK periods delay between WCLK edge and MSB of first word */
    DL_I2S_DATA_DELAY_MAX = I2S_FMTCFG_DATADLY_MAX,
} DL_I2S_DATA_DELAY;

/** @enum DL_I2S_EMPTY_SLOT_OUTPUT */
typedef enum {
    /*! Send out zeroes in empty slots */
    DL_I2S_EMPTY_SLOT_OUTPUT_ZERO = I2S_FMTCFG_EMPTYSLOTOUTPUT_ZERO,
    /*! Send out ones in empty slots */
    DL_I2S_EMPTY_SLOT_OUTPUT_ONE = I2S_FMTCFG_EMPTYSLOTOUTPUT_ONE,
    /*! Tristate data pin line during empty slot */
    DL_I2S_EMPTY_SLOT_OUTPUT_TRISTATE = I2S_FMTCFG_EMPTYSLOTOUTPUT_TRISTATE,
} DL_I2S_EMPTY_SLOT_OUTPUT;

