TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G5187/driverlib/empty_driverlib_src/ti/driverlib/dl_i2s.h
    return (DL_I2S_WCLK_PHASE)(wclkPhase);
}

/**
 *  @brief      Set WCLK phase
 *
 *  @param[in]  i2s         Pointer to the register overlay for the peripheral
 *
 *  @param[in]  wclkPhase   WCLK phase. One of @ref DL_I2S_WCLK_PHASE.
 */
__STATIC_INLINE void DL_I2S_setWCLKPhase(
    I2S_Regs *i2s, DL_I2S_WCLK_PHASE wclkPhase)
{
    DL_Common_updateReg(
        &i2s->CLKCTL, (uint32_t) wclkPhase, I2S_CLKCTL_WCLKPHASE_MASK);
}

/**
 *  @brief Set MCLK divider
 *
 *  @param[in]  i2s                     Pointer to the register overlay for the
 *                                      peripheral
 *  @param[in]  mclkDivider             MCLK divider.
 *  [ @ref DL_I2S_MDIV_MINIMUM, @ref DL_I2S_MDIV_MAXIMUM ]
 *
 *  @sa         @ref DL_I2S_MDIV_INVALID
 */
__STATIC_INLINE void DL_I2S_setMCLKDivider(I2S_Regs *i2s, uint32_t mclkDivider)
{
    DL_Common_updateReg(&i2s->MCLKDIV, mclkDivider, I2S_MCLKDIV_MDIV_MASK);
}

/**
 *  @brief      Get MCLK divider
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *
 *  @return     MCLK divider
 *
 *  @retval     [ @ref DL_I2S_MDIV_MINIMUM, @ref DL_I2S_MDIV_MAXIMUM ]
 *
 *  @sa         @ref DL_I2S_MDIV_INVALID
 */
__STATIC_INLINE uint32_t DL_I2S_getMCLKDivider(const I2S_Regs *i2s)
{
    uint32_t mclkDivider = i2s->MCLKDIV & I2S_MCLKDIV_MDIV_MASK;

    return (mclkDivider);
}

/**
 *  @brief Set WCLK divider.
 *
 *  @note For single-phase and dual-phase frame formats, WDIV[9:0] are used for
 *  the clock calcuation, making 1023 the maximum factor of the division ratio.
 *  @note For user-defined frame formats such as PCM (long) and TDM formats,
 *  WCLK is high for WDIV[7:0] and low for WDIV[15:8], making both high and low
 *  portions have a maximum factor of 255.
 *
 *  @param[in]  i2s            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  wclkDivider    WCLK divider to set. [0x1, 0xFFFF]
 */
__STATIC_INLINE void DL_I2S_setWCLKDivider(I2S_Regs *i2s, uint32_t wclkDivider)
{
    DL_Common_updateReg(&i2s->WCLKDIV, wclkDivider, I2S_WCLKDIV_WDIV_MASK);
}

/**
 *  @brief      Get WCLK divider
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *
 *  @return     WCLK divider
 *
 *  @retval     [0x1, 0xFFFF]
 */
__STATIC_INLINE uint32_t DL_I2S_getWCLKDivider(const I2S_Regs *i2s)
{
    uint32_t wclkDivider = i2s->WCLKDIV & I2S_WCLKDIV_WDIV_MASK;

    return (wclkDivider);
}

/**
 * @brief Set BCLK divider
 *
 *  @param[in]  i2s            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  bclkDivider    BCLK divider. [ @ref DL_I2S_BDIV_MINIMUM, @ref DL_I2S_BDIV_MAXIMUM ]
 *
 *  @sa         @ref DL_I2S_BDIV_INVALID
 */
__STATIC_INLINE void DL_I2S_setBCLKDivider(I2S_Regs *i2s, uint32_t bclkDivider)
{
    DL_Common_updateReg(&i2s->BCLKDIV, bclkDivider, I2S_BCLKDIV_BDIV_MASK);
}

/**
 *  @brief      Get BCLK divider
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *
 *  @return     BCLK divider
 *
 *  @retval     [ @ref DL_I2S_BDIV_MINIMUM, @ref DL_I2S_BDIV_MAXIMUM ]
 *
 *  @sa         @ref DL_I2S_BDIV_INVALID
 */
__STATIC_INLINE uint32_t DL_I2S_getBCLKDivider(const I2S_Regs *i2s)
{
    uint32_t bclkDivider = i2s->BCLKDIV & I2S_BCLKDIV_BDIV_MASK;

    return (bclkDivider);
}

/**
 *  @brief Sets the sample word length in bits. In single-phase format, this is
 *  the exact number of bits per word. In dual-phase format, this is the
 *  maximum number of bits per word.
 *
 *  @note Values written to the hardware should be 1 less than the desired
 *  sample word length e.g. a desired sample word length of 8 bits requires
 *  the value of 7 to be written. Sample word lengths less than 8 and above 32
 *  bits will result in undefined behavior.
 *
 *  @param[in] i2s Pointer to the register overlay for the peripheral
 *  @param[in] sampleWordLength Sample word length (in bits) to set. [7, 31]
 */
__STATIC_INLINE void DL_I2S_setSampleWordLength(
    I2S_Regs *i2s, uint32_t sampleWordLength)
{
    DL_Common_updateReg(
        &i2s->FMTCFG, sampleWordLength, I2S_FMTCFG_WORDLEN_MASK);
}

/**
 *  @brief Get the sample word length in bits
 *
 *  @note Values read from the hardware will be 1 less than the true
 *  sample word length e.g. a value of 7 read from the hardware means that the
 *  sample word length is 8 bits.
 *
 *  @param[in] i2s Pointer to the register overlay for the peripheral
 *
 *  @return Sample word length in bits
 *
 *  @retval Value in range [7, 31]
 */
__STATIC_INLINE uint32_t DL_I2S_getSampleWordLength(const I2S_Regs *i2s)
{
    uint32_t sampleWordLength = i2s->FMTCFG & I2S_FMTCFG_WORDLEN_MASK;

    return (sampleWordLength);
}

/**
 *  @brief Set between single or dual-phase format
 *
 *  @note Single-phase: DSP format
 *  @note Dual-phase: I2S, LJF and RJF formats
 *
 *  @param[in] i2s Pointer to the register overlay for the peripheral
 *  @param[in] phase The sampling phase to use. One of @ref DL_I2S_PHASE
 */
__STATIC_INLINE void DL_I2S_setFormatPhase(I2S_Regs *i2s, DL_I2S_PHASE phase)
{
    DL_Common_updateReg(
        &i2s->FMTCFG, (uint32_t) phase, I2S_FMTCFG_DUALPHASE_MASK);
}

/**
 *  @brief Get the sampling phase being used
 *
 *  @param[in] i2s Pointer to the register overlay for the peripheral
 *
 *  @return The sampling phase being used
 *
 *  @retval One of @ref DL_I2S_PHASE
 */
__STATIC_INLINE DL_I2S_PHASE DL_I2S_getFormatPhase(const I2S_Regs *i2s)
{
    uint32_t phase = i2s->FMTCFG & I2S_FMTCFG_DUALPHASE_MASK;

    return ((DL_I2S_PHASE)(phase));
}

/**
 *  @brief Set the sample edge of data on BCLK.
 *
 *  @note On negative sample edge, data is sampled on the negative edge of
 *  BCLK and clocked out on the positive edge.
 *  @note On positive sample edge, data is sampled on the positive edge of
 *  BCLK and clocked out on the negative edge.
 *
 *  @param[in] i2s Pointer to the register overlay for the peripheral
 *  @param[in] edge The sample edge to use. One of @ref DL_I2S_SAMPLE_EDGE
 */
__STATIC_INLINE void DL_I2S_setSampleEdge(
    I2S_Regs *i2s, DL_I2S_SAMPLE_EDGE edge)
{
    DL_Common_updateReg(
        &i2s->FMTCFG, (uint32_t) edge, I2S_FMTCFG_SMPLEDGE_MASK);
}

/**
 *  @brief Gets the sample edge being used
 *
 *  @param[in] i2s Pointer to the register overlay for the peripheral
 *
 *  @return The sample edge being used
 *
 *  @retval One of @ref DL_I2S_SAMPLE_EDGE
 */
__STATIC_INLINE DL_I2S_SAMPLE_EDGE DL_I2S_getSampleEdge(const I2S_Regs *i2s)
{
    uint32_t edge = i2s->FMTCFG & I2S_FMTCFG_SMPLEDGE_MASK;

    return ((DL_I2S_SAMPLE_EDGE)(edge));
}

/**
 *  @brief Set the size of each sample word stored to or loaded from memory
 *
 *  @param[in] i2s    Pointer to the register overlay for the peripheral
 *  @param[in] length The memory access length to use.
 *                    One of @ref DL_I2S_MEMORY_LENGTH
 */
__STATIC_INLINE void DL_I2S_setMemoryLength(
    I2S_Regs *i2s, DL_I2S_MEMORY_LENGTH length)
{
    DL_Common_updateReg(
        &i2s->FMTCFG, (uint32_t) length, I2S_FMTCFG_MEMLEN32_MASK);
}

/**
 *  @brief Get the size of sample words stored to or loaded from memory
 *
 *  @param[in] i2s Pointer to the register overlay for the peripheral
 *
 *  @return The memory access length being used
 *
 *  @retval One of @ref DL_I2S_MEMORY_LENGTH
 */
__STATIC_INLINE DL_I2S_MEMORY_LENGTH DL_I2S_getMemoryLength(
    const I2S_Regs *i2s)
{
    uint32_t length = i2s->FMTCFG & I2S_FMTCFG_MEMLEN32_MASK;

    return ((DL_I2S_MEMORY_LENGTH)(length));
}

/**
 *  @brief Set the number of BCLK periods to wait between a WCLK edge and the
 *  MSB of the first word in a phase
 *
 *  @note Data delay of 0 - LJF and DSP formats
 *  @note Data delay of 1 - I2S and DSP formats
 *  @note Data delay of 2 (minimum) - RJF format
 *  @note Data delay of 255 (maximum) - RJF format

 *  @param[in] i2s Pointer to the register overlay for the peripheral
 *  @param[in] dataDelay The data delay to use. One of @ref DL_I2S_DATA_DELAY
 */
__STATIC_INLINE void DL_I2S_setDataDelay(
    I2S_Regs *i2s, DL_I2S_DATA_DELAY dataDelay)
{
    DL_Common_updateReg(
        &i2s->FMTCFG, (uint32_t) dataDelay, I2S_FMTCFG_DATADLY_MASK);
}

/**
 *  @brief Gets the data delay being used
 *
 *  @param[in] i2s Pointer to the register overlay for the peripheral
 *
 *  @return The data delay being used
 *
 *  @retval One of @ref DL_I2S_DATA_DELAY
 */
__STATIC_INLINE DL_I2S_DATA_DELAY DL_I2S_getDataDelay(const I2S_Regs *i2s)
{
    uint32_t dataDelay = i2s->FMTCFG & I2S_FMTCFG_DATADLY_MASK;

